#include "functions.h"
#include <stdio.h>
#include <stdlib.h>

/*Создать в отдельном модуле функции с переменным количеством аргументов, которая вычисляет их сумму, максимум, минимум, среднее арифметическое.*/

int main()
{   
    printf("numbers: 16, 8, 10, 4, 67.\n");
    printf("sum: %.2f\n", sum(5, 16.0, 8.0, 10.0, 4.0, 67.0));
    printf("max: %.2f\n", max(5, 16.0, 8.0, 10.0, 4.0, 67.0));
    printf("min: %.2f\n", min(5, 16.0, 8.0, 10.0, 4.0, 67.0));
    printf("avg: %.2f\n", avg(5, 16.0, 8.0, 10.0, 4.0, 67.0));

    printf("numbers: 16.5, 8.6, 10.2, 4.3, 67.67.\n");
    printf("sum: %.2f\n", sum(5, 16.5, 8.6, 10.2, 4.3, 67.67));
    printf("max: %.2f\n", max(5, 16.5, 8.6, 10.2, 4.3, 67.67));
    printf("min: %.2f\n", min(5, 16.5, 8.6, 10.2, 4.3, 67.67));
    printf("avg: %.2f\n", avg(5, 16.5, 8.6, 10.2, 4.3, 67.67));
    
    return 0;
}